In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'C:\Rohan\Github\SQL\Coding Easy Tasks\Total Employees in each department - Task 2.csv')

In [3]:
df.head()

   worker_id first_name last_name  salary joining_date department
0          1     Monika     Arora  100000    2/20/2014         HR
1          2   Niharika     Verma   80000    6/11/2014      Admin
2          3     Vishal   Singhal  300000    2/20/2014         HR
3          4     Amitah     Singh  500000    2/20/2014      Admin
4          5      Vivek     Bhati  500000    6/11/2014      Admin

In [4]:
df.tail()

    worker_id first_name last_name  salary joining_date department
7           8    Geetika   Chauhan   90000    4/11/2014      Admin
8           9      Agepi     Argon   90000    4/10/2015      Admin
9          10        Moe   Acharya   65000    4/11/2015         HR
10         11      Nayah   Laghari   75000    3/20/2014    Account
11         12        Jai     Patel   85000    3/21/2014         HR

In [5]:
# Import sqlite3 package
import sqlite3

In [6]:
# Obtain all the columns of this dataset
df.columns

Index(['worker_id', 'first_name', 'last_name', 'salary', 'joining_date',
       'department'],
      dtype='object')

In [7]:
# Obtain the dimensions of this dataset
df.shape

(12, 6)

This dataset has only 12 rows and 6 attributes

In [8]:
# import sqlalchemy and create a sqlite engine
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

# export the dataframe as a table to the sqlite engine
df.to_sql("df", con =engine)

12

In [9]:
## Test the code by select the complete table
# Obtain the first 5 rows

sql='''

Select * from df
limit 5


''';

    
df_sql = pd.read_sql_query(sql,con=engine)
df_sql.head()

   index  worker_id first_name last_name  salary joining_date department
0      0          1     Monika     Arora  100000    2/20/2014         HR
1      1          2   Niharika     Verma   80000    6/11/2014      Admin
2      2          3     Vishal   Singhal  300000    2/20/2014         HR
3      3          4     Amitah     Singh  500000    2/20/2014      Admin
4      4          5      Vivek     Bhati  500000    6/11/2014      Admin

In [10]:
# Obtain the total number of records from this table
sql='''

SELECT COUNT(*) AS [Total Number of Records]
FROM df;


''';

    
df_sql = pd.read_sql_query(sql,con=engine)
df_sql

   Total Number of Records
0                       12

In [12]:
# Find the number of employees in each department
sql='''

SELECT department, COUNT(worker_id) AS [Number of Employees per Dept]
FROM df
GROUP BY department;


''';

    
df_sql = pd.read_sql_query(sql,con=engine)
df_sql

  department  Number of Employees per Dept
0    Account                             3
1      Admin                             5
2         HR                             4

In [13]:
# Sort the above table in descending order
sql='''

SELECT department, COUNT(worker_id) AS [Number of Employees per Dept]
FROM df
GROUP BY department
ORDER BY [Number of Employees per Dept] DESC;


''';

    
df_sql = pd.read_sql_query(sql,con=engine)
df_sql

  department  Number of Employees per Dept
0      Admin                             5
1         HR                             4
2    Account                             3